{
    "navAbout": "over",
    "navBlog": "blog",
    "navProjects": "projecten",
    "navContact": "contact",

    "heroTitle": "Hey, ik ben Michael | Software Ingenieur",
    "heroCTA": "Meer weten",

    "notFound": "De pagina die je zoekt, bestaat niet",
    "notFoundCTA": "Terug naar home",
    "offline": "Pagina kan niet laden, je bent offline",

    "homepageAboutMeTitle": "Mijn talenten",
    "homepageAboutMeSubtitle": "Ik hou ervan om dingen te bouwen",
    "homepageAboutMeSummary": "Ik maakte al op jonge leeftijd kennis met computers. Ik was altijd gefascineerd door de manier waarop ze werkten, en hoe ze gebruikt konden worden om applicaties te creëren. Ik begon met eenvoudige spelletjes en animaties, en ging daarna over op het bouwen van websites. Ik hou van het gevoel iets vanaf nul te creëren en het tot leven te zien komen. Ik ben altijd op zoek naar nieuwe uitdagingen en manieren om mijn vaardigheden te verbeteren.",
    "homepageAboutMeResumeButton": "CV",
    "homepageAboutMeReadMoreButton": "Lees meer",

    "aboutMeTitle": "Ik heb altijd al van technologie gehouden",
    "aboutMeSubtitle": "Op zoek naar mijn ",
    "aboutMeQuickStoryTitle": "Mijn verhaal",
    "aboutMeQuickStory": "<span>Ik maakte kennis met computers toen ik 6 jaar oud was.</span> Als kind speelde ik vaak videospelletjes en begon vanuit de fascinatie in de werking ervan deze ook zelf te maken. Van simpele spelletjes en animaties ben ik overgegaan tot het bouwen van eenvoudige websites. In de middelbare school heb ik mij opgewerkt van elektriciteit tot informatica. Ik leerde hoe ik moest coderen en had het gevoel eindelijk mijn passie  gevonden te hebben. Vanuit die achtergrond, was het doen van een <span>bachelor in de Toegepaste Informatica</span> een geweldige manier om mezelf verder te verdiepen in de materie. <span>Sindsdien ben ik niet gestopt met leren en creëren.</span> Ik ben betrokken bij meerdere projecten en ben altijd op zoek naar nieuwe uitdagingen.<br/><br/>De laatste jaren ben ik steeds meer <span>bezig met softwareontwikkeling, zowel in mijn werk als privé. </span>Ik heb het geluk gehad samen te werken met senior ontwikkelaars en ontwerpers, die me hebben geleerd wat er van een kwaliteitsproduct wordt verwacht.<br/><br/>",
    "aboutMeAsDeveloperTitle": "Als ontwikkelaar",
    "aboutMeAsDeveloper": "Ik besteed veel <span>aandacht aan de leesbaarheid van mijn code.</span> Ik zet iets zo snel mogelijk in elkaar om het te laten werken, maar daarna besteed ik graag veel tijd aan commentaar en het organiseren van de code zodat het <span>makkelijk te begrijpen en te onderhouden</span> is.<br/><br/><span>Consistente, leesbare en onderhoudbare code.</span> Het is geweldig als functies werken, maar het is nog beter als ze blijven werken, ongeacht wie eraan werkt. Daarom probeer ik altijd testen te schrijven voor mijn code. Het is een geweldige manier om ervoor te zorgen dat alles werkt zoals verwacht en dat het ook in de toekomst blijft werken.<br/><br/>Ik ben altijd enthousiast om aan nieuwe projecten te werken. Zo kan ik <span>telkens iets nieuws leren.</span> Ik ben benieuwd wat de toekomst brengt.<br/><br/>",
    "aboutMeAsPersonTitle": "Als persoon",
    "aboutMeAsPerson": "Ik zou mezelf omschrijven als een <span>sociaal en vindingrijk</span> persoon. Ik ontmoet graag nieuwe mensen, omdat ik het interessant vind om hun perspectief omtrent bepaalde onderwerpen te horen. Ik sta bovendien altijd <span>open voor nieuwe ervaringen en uitdagingen.</span> Verder ben ik iemand die een probleem in kleinere stukjes zal opdelen om een gepaste oplossing te vinden. <span>Ik ben van nature gedisciplineerd en houd mezelf graag bezig.</span> Tijd is kostbaar en ik probeer er het beste van te maken. Ik streef er daarom naar mijn tijd verstandig te investeren in leren of het maken van herinneringen met mensen die dicht bij me staan.<br/><br/>",
    "aboutMeAsColleagueTitle": "Als collega",
    "aboutMeAsColleague": " Ik ben iemand die zijn best zal doen om met iedereen overeen te komen, in dat opzicht ben ik wel een <span>teamspeler</span>. In elke context zal ik proberen om mijn team te helpen dat extra stapje te zetten. In gesprek met anderen ben ik een <span>goede luisteraar</span> en kan ik de <span>gepaste vragen stellen om het gesprek gaande te houden.</span> Ik sta <span>open voor feedback en de mening van anderen</span> als die me kan helpen om mijn job beter te doen. Verder kan ik ook mijn eigen ideeën op een gepaste manier overbrengen en mijn denkproces hierbij uitleggen op een manier die iedereen kan begrijpen.</span><br/><br/>Door mijn ervaring bij kleinere bedrijven heb ik alle verschillende aspecten van een project leren kennen. <br/><span>Ik ben betrokken geweest bij het ontwerp, de ontwikkeling en de implementatie van meerdere projecten.</span> Ik heb daarnaast ook het geluk gehad betrokken te zijn bij de zakelijke kant van het bedrijf, waardoor ik een beter begrip heb van hoe een bedrijf werkt.<br/><br/>Als je nog meer over me wilt weten of graag zou willen samenwerken, aarzel dan niet om contact op te nemen.",

    "contactTitle": "Nog vragen?",
    "contactSubtitle": "Ik hoor graag van je",
    "contactCTA": "Contacteer me",

    "featuredBlogpostsTitle": "In de kijker",
    "featuredBlogpostsCTA": "Lees de volledige post",
    "featuredBlogpostsDisabled": "Binnenkort te lezen",
    "featuredBlogpostsMore": "Meer blog posts",

    "blogpostGoalTitle": "Inleiding en doel van het project",
    "blogpostStackTitle": "Project koers",
    "blogpostResultTitle": "Resultaat",
    "blogpostCourseTitle": "Verloop",

    "spinakerTitle": "Spinaker project Katowice",
    "spinakerIntro": "Begin februari hoorde ik dat er een opportuniteit was om naar Polen te gaan met enkele andere studenten van mijn hogeschool om deel te nemen aan een project genaamd Spinaker. Om je aan te melden voor dit project moest je een uitgebreid essay schrijven over waarom je aan dit project wilde deelnemen en wat je kon bijdragen. <span>De selectie was gebaseerd op je opstel en eerder behaalde cijfers.</span> Enkele weken later kreeg ik het nieuws dat ik geselecteerd was om mee te gaan naar Polen. Het project ging plaatsvinden van 4 tot 9 april.",
    "spinakerGoal": "Toen ik in Katowice aankwam, werd ik begroet door de andere studenten die voor dit project waren geselecteerd. <span>We kwamen allemaal uit verschillende landen en hadden verschillende achtergronden.</span> Sommige studenten waren mede-software-ingenieurs en anderen studeerden marketing of business. We begonnen de dag met elkaar wat beter te leren kennen tijdens het ontbijt, waarna we verdeeld werden in groepen en een mentor toegewezen kregen.<span> Mijn groep moest een webapplicatie maken voor de school</span> waar het project plaatsvond. De website zou de studenten van marketing en business toelaten om hun use cases te testen in een interactieve omgeving.",
    "spinakerCourse": "De rest van de week werd er gewerkt aan de website. We moesten een <span>ontwerp maken voor de website en deze vervolgens implementeren.</span> Hiernaast werd gevraagd om rekening te houden met de use cases die de studenten marketing en reclame moesten uittesten. Samen met onze mentor <span>creëerden we een workflow waarmee we efficiënt konden werken.</span> Daarnaast gebruikten we de <span>agile methodologie</span> om de website te maken. We hadden dagelijkse standups en gebruikten het scrumbord om onze voortgang bij te houden. Uiteindelijk konden we een website maken die de use cases kon testen.",
    "spinakerResult": "Dit project was een geweldige ervaring. <span>Ik kon samenwerken met studenten uit heel Europa en heb veel geleerd over de agile methodologie. </span>Niet alleen was het project een geweldige ervaring, maar ik heb ook de prachtige stad Katowice kunnen bezoeken en heb een aantal nieuwe vrienden uit andere landen gemaakt die ik later dit jaar zal bezoeken. Zeker een aanrader voor iedereen die geïnteresseerd is in softwareontwikkeling en meer wil leren over marketing en reclame.",
    "spinakerRecap": "Een samenvatting over een internationaal project in het economische hart van Polen: Katowice. Ik werd geselecteerd om deel uit te maken van het software ingenieurs team, samen met 7 andere studenten van mijn hogeschool.",
    "spinakerSmallRecap": "Een samenvatting over een internationaal project in het economische hart van Polen: Katowice.",
    "spinakerDate": "April 27, 2022",
    "spinakerLogoSrc": "/images/katowiceUniversityLogo.jpg",
    "spinakerLogoAlt": "Universiteit Katowice Logo",
    "spinakerOutroSrc": "/images/spinaker.jpg",
    "spinakerOutroAlt": "Alle deelnemende studenten samen",
    "spinakerIntroSrc": "/images/katowiceUniversity.jpg",
    "spinakerIntroAlt": "De Universiteit van Economie in Katowice",

    "commonEuropeTitle": "Common Europe Congress 2022",
    "commonEuropeIntro": "Ik heb altijd een <span> diepgaande interesse gehad voor IT</span> en alles eromheen. Toen ik voor het eerst hoorde over het IBM congres in Alicante was ik erg enthousiast om te leren over alles wat het te bieden had. In de opleiding van mijn hogeschool, leerden we niet over infrastructuur, databases, en power systemen op dezelfde manier als bedrijven dat doen. Daarom was het congres een <span>geweldige leermogelijkheid</span> om mijn kennis rond deze onderwerpen te verbeteren.",
    "commonEuropeGoal": "Voordat ik het congres ging bijwonen, heb ik eerst alle sprekers en onderwerpen grondig overlopen. <span>Het belangrijkste doel was om zo veel mogelijk te leren over nuttige onderwerpen.</span> Ik was vooral geïnteresseerd in drie verschillende sessies. De eerste ging over Data centric - Moving Business Logic into the Database. Ik was erg geïnteresseerd in dit onderwerp omdat het me <span>out of the box deed denken.</span> Normaal gesproken zou je applicatie-gecentreerd denken en niet database-gecentreerd, of in ieder geval niet op dezelfde manier.<br/><br/> Het tweede onderwerp waarin ik geïnteresseerd was, ging over <span>Kafka en Node.js.</span> Ik had een basiskennis van Node.js, maar ik wilde er meer over leren. Ik had nog niet van Kafka gehoord en was erg enthousiast om te horen dat het hielp bij het integreren van event streaming platforms met Javascript.<br/><br/>Het laatste onderwerp ging over <span>DevSecOps.</span> Ik had nog niet veel kennis in verband met het onderwerp. <span>Ik wilde er meer over leren om te zien of dit me in de toekomst iets zou bijbrengen.</span> De DevSecOps was specifiek op IBM systemen, waar ik nog nooit eerder mee te maken heb gehad. Dat maakte het zeker boeiend.",
    "commonEuropeCourse": "Toen we op het congres aankwamen, werden we begroet door het personeel van IBM. Ze waren erg vriendelijk en gaven ons een warm welkom. We kregen een rondleiding in het congres en kregen te zien waar alles was. Hiernaast kregen we ook een schema van alle sessies die zouden plaatsvinden. Zo konden we kiezen welke sessies we wilden bijwonen. We kregen ook een badge waarmee we ons in en uit de sessies konden scannen. <br/><br/>Ik heb in totaal <span>3 sessies bijgewoond.</span> Ze waren allemaal erg interessant en ik heb er veel uit geleerd. We hadden de mogelijkheid om aantekeningen te maken en achteraf konden we ook vragen stellen aan de sprekers. Ik heb ook deelgenomen aan enkele vrijetijdsactiviteiten van het congres, zoals golfen. Ik heb <span>veel nieuwe mensen ontmoet en nieuwe vrienden gemaakt.</span> We eindigden het congres met een leuk diner en een feest.",
    "commonEuropeResult": "Ik heb op dit congres <span>veel kunnen leren, niet alleen over IBM infrastructuur en systemen, maar ook over de Spaanse cultuur en de stad Alicante. </span>Door het congres heb ik nieuwe mensen ontmoet en een voet tussen de deur van IBM kunnen zetten. Ik hoop in de toekomst ooit met IBM-systemen te kunnen werken.",
    "commonEuropeRecap": "Een samenvatting over het Common Europe Congress 2022 in Alicante, Spanje, waar ik met 20 andere studenten uit Europa was geselecteerd om deel te nemen aan het congres. Het congres werd gehouden van 13 tot 16 juni 2022.",
    "commonEuropeSmallRecap": "Een samenvatting over het Common Europe Congress 2022 in Alicante, Spanje.",
    "commonEuropeDate": "Juni 25, 2022",
    "commonEuropeLogoSrc": "/images/commonEuropeLogo.jpg",
    "commonEuropeLogoAlt": "Common Europe Logo",
    "commonEuropeOutroSrc": "/images/commonEuropeGroup.jpg",
    "commonEuropeOutroAlt": "Alle deelnemende studenten samen",
    "commonEuropeIntroSrc": "/images/commonEuropeEntrance.jpg",
    "commonEuropeIntroAlt": "Ingang van het congres",

    "cloudResumeTitle": "Zet je CV in de cloud",
    "cloudResumeContent": "<h2>Mijn CV leeft in de cloud 🌩</h2><br> Dit gebeurt er wanneer je klikt op <a href='https://mvanhoutte.com'>mvanhoutte.cloud</a> <br><br><a href='https://www.netlify.com/'>Netlify</a> routeert je aanvraag naar de HTML, CSS en JS bestanden die zich bevinden in een Github opslagplaats. Deze worden gecached door Github. Dat betekent dat er <strong>een kopie op meer dan 200+ plaatsen wereldwijd is.</strong> Dus ongeacht of je connecteert van Frankrijk of Singapore, je krijgt de bestanden zo snel mogelijk.<br><br>Onthoud, <strong>het internet is een hoop fysiek geconnecteerde computers</strong> Die informatie uitwisselen aan (bijna) de snelheid van het licht. Dichter zijn bij de informatie die je wilt, betekent snellere laadtijden.<br><br><strong>Ondertussen aan de kant van de cliënt</strong><br><br>Wanneer je connecteert met de <a href='https://mvanhoutte.com'>website</a>, dan zet je een <a href='https://docs.aws.amazon.com/lambda/latest/dg/welcome.html'>serverloze functie</a> in. Dit betekent dat in de plaats dat er 24/7 een server aanstaat, <strong>bestaat de functie op aanvraag.</strong><br><br>De functie vraagt data aan mijn <a href='https://aws.amazon.com/dynamodb'>DynamoDB</a> database. Het neemt de hoeveelheid bezoekers, voegt eentje toe, en slaat dat vervolgens weer op. De functie geeft de waarde terug en toont deze op de website.<br><br><img style='display:flex; margin:0 auto;' src='/images/visitors.jpg' alt='Resume visitors' /><br><strong>Continue deployen</strong><br><br>Op Github, wanneer ik veranderingen doorstuur naar de hoofd branch. <strong>Dan wordt er een actie uitgevoerd die de cache invalideert.</strong> Dit betekent dat wanneer je de volgende keer connecteert, dan krijg je de laatste versie van de bestanden.<br><br><strong>Maar waarom?</strong><br><br>Wanneer je een kleine applicatie ontwikkelt, dan duurt het vaak een lange tijd voordat alles klaarstaat. Alles wat we nu gedaan hebben zorgt ervoor dat dit veel gemakkelijker gaat, zoals bijvoorbeeld bij het hosten van je website of het maken van een API.<br><br><strong>References</strong><br><br> Heel veel dank aan <a href='https://forrestbrazeal.com/'>forrestbrazeal</a> voor het creëren van de <a href='https://forrestbrazeal.com/2020/04/23/the-cloud-resume-challenge/'>cloud resume challenge</a>. Hierdoor zijn mijn ogen geopend voor een hele wereld van cloud oplossingen. Nu gebruik ik ze voor alles.<br><br><strong>Implementeren van beveiliging</strong><br><br>Ik heb een gelijktijdigheidslimiet gezet op de lambda functie. Dit betekent dat wanneer iemand mijn leven lastiger wilt maken door de bezoekers aanvraag teller te spammen, dan is het gelimiteerd op 5 aanvragen per minuut.",
    "cloudResumeRecap": "Zet je CV in de cloud door middel van cloud technologieën. Zo heb je jouw CV altijd bij de hand en kan je het snel en eenvoudig delen met anderen.",
    "cloudResumeSmallRecap": "Maak het snel en een leuke gespreksstarter voor interviews. Houd je cv altijd bij de hand.",
    "cloudResumeDate": "December 16, 2022",
    "cloudResumeLogoSrc": "/images/cloud.jpg",
    "cloudResumeLogoAlt": "Common Europe Logo",

    "projectsTitle": "Projecten",
    "projectCTA": "Zie project",
    "projectGoalTitle": "Doel van het project",
    "projectStackTitle": "Uitleg van de web stack",
    "projectFurtherTitle": "Toekomstig werk",
    "projectDisabled": "Binnenkort",

    "portfolioTitle": "Portfolio website",
    "portfolioType": "PERSOONLIJK PROJECT",
    "portfolioSummary": "Ik heb deze website gebouwd om mijn werk en vaardigheden te laten zien, en om mensen een beter inzicht te geven in wie ik ben.",
    "portfolioSrc": "/images/portfolioThumbnail.png",
    "portfolioAlt": "Thumbnail van de portfolio website",
    "portfolioIntro": "Als software ingenieur is het erg belangrijk om jezelf goed te kunnen presenteren en te laten zien dat je in staat bent om <span>complexe weboplossingen te creëren.</span> Ik heb deze website ontwikkeld om mijn vaardigheden en eerdere projecten te laten zien, zodat mijn toekomstige werkgever een <span>beter beeld krijgt van wie ik ben en wat ik kan.</span>",
    "portfolioGoal": "Deze website was bedoeld als een eenvoudig persoonlijk project waar ik een aantal van de projecten die ik heb ontwikkeld laat zien samen met een korte samenvatting van wie ik ben. Later besloot ik een blog gedeelte aan de website toe te voegen waar ik kon schrijven over <span>mijn ervaringen als software ingenieur</span> samen met nog een deel van de kennis die ik over de jaren heen heb kunnen opdoen. Ik besloot ook vertalingen aan de website toe te voegen, zodat het toegankelijk zou zijn voor een breder publiek. In het algemeen wilde ik <span>zoveel mogelijk nuttige functionaliteit toevoegen om verder te leren over verschillende technologieën</span> die ik gebruikte.",
    "portfolioStack": "Voor dit project wilde ik gaan voor een framework waarmee ik een <span>website kan maken die snel en SEO-vriendelijk is. </span>Next.js is daarvoor een geweldig framework. Next.js heeft SSR (Server Side Rendering) waardoor je website aan de server kant wordt gerenderd in plaats van aan de client kant. Dit zorgt ervoor dat <span>de inhoud er al is wanneer een gebruiker de website bezoekt.</span> Ik heb styled-components toegevoegd aan het project om het makkelijker te maken om de website te stylen. Verder heb ik ook een paar andere bibliotheken toegevoegd om het eenvoudiger te maken om sommige componenten te creëren. Ik gebruikte bijvoorbeeld react-helmet-async om <span>meta tags en pagina titels toe te voegen aan de website om de SEO en SEA te optimaliseren.</span> Ik koos deze technologieën niet alleen vanwege de voordelen die ze bieden, maar ook omdat ik er <span>meer over wilde leren.</span>",
    "portfolioFurther": "Op het huidige moment heb ik geen plannen om nog grote veranderingen toe te voegen. Ik zou nog enkele projecten aan de website kunnen toevoegen en nog enkele blogberichten. Ik overweeg nog steeds om verschillende talen aan de website toe te voegen, maar ik weet nog niet zeker of ik dat zal doen. Verder staan er geen grote veranderingen meer op de planning.",
    "portfolioOutroSrc": "/images/performance.jpg",
    "portfolioOutroAlt": "Google Lighthouse website performantie metrieken",
    "portfolioIntroSrc": "/images/introduce.jpg",
    "portfolioIntroAlt": "introductie foto met pratende mensen",

    "fitnessAppTitle": "Fitness app",
    "fitnessAppType": "PERSOONLIJK PROJECT",
    "fitnessAppSummary": "Deze app helpt je om je fitnessdoelen en vooruitgang bij te houden. Je kunt er ook je eigen trainingen en oefeningen mee maken.",
    "fitnessAppSrc": "/images/fitnessComingSoon.png",
    "fitnessAppAlt": "Fitness thumbnail image",

    "footerFollowMe": "Volg me op",
    "footerBuiltBy": "© 2022, Gebouwd door Michael Vanhoutte",
    "footerLinks": "Links",
    "footerAbout": "Over",
    "footerBlog": "Blog",
    "footerProjects": "Projecten",
    "footerContact": "Contact"
}
